app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "tse"], ["room_number", 0], ["created_at", "2020-08-06 22:41:32.396410"], ["updated_at", "2020-08-06 22:41:32.396410"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params)

    if @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
def show
  @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
def edit
  @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 14], ["updated_at", "2020-08-06 23:32:35.266914"], ["id", 10]]
---
def update
  @school_class = SchoolClass.find(params[:id])
  @school_class.update(school_class_params)