app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "asdfa"], ["last_name", "asdf"], ["created_at", "2020-08-07 00:10:16.978854"], ["updated_at", "2020-08-07 00:10:16.978854"]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "4th first"], ["last_name", "4th Last Last"], ["updated_at", "2020-08-07 00:14:05.536254"], ["id", 4]]